{
    "audioResponse": {
      "results": {
        "openai": {
          "text": "Ваше дело займет значительную часть вашей жизни, и единственный способ быть по-настоящему довольным — это делать то, что вы считаете великим делом. И единственный способ делать великую работу — это любить то, что вы делаете. Если вы еще не нашли это, продолжайте искать. Не останавливайтесь. Как и во всех делах сердца, вы узнаете, когда найдете это. Продолжайте искать, не останавливайтесь. Оставайтесь голодными, оставайтесь безрассудными. Спасибо."
        }
      }
    },
    "videoResponse": {
      "description": {
        "summary": {
          "Ориентация Тела": 9,
          "Выражения Лица": 10,
          "Анализ Жестов": 9,
          "Невербальные Сигналы": 9,
          "Анализ Позы": 10,
          "Анализ Положения": 9,
          "Использование Пространства": 10
        },
        "details": {
          "Анализ Положения": {
            "ДлительностьПоложений": {
              "Стоя": "Докладчик стоял большую часть времени, сохраняя уверенную и открытую позу.",
              "Сидя": "Докладчик не сидел во время выступления.",
              "Наклоняясь": "Докладчик иногда наклонялся вперед, что добавляло акцент на ключевые моменты."
            },
            "ЧастотаИТипыСменыПоложений": {
              "СтояКНаклону": "Докладчик иногда переходил от стояния к наклону вперед, чтобы подчеркнуть важные моменты.",
              "НаклонКСтоянию": "Докладчик плавно возвращался в стоячее положение, сохраняя вовлеченность."
            },
            "СтабильностьИБаланс": {
              "ДлительностьСтабильности": "Докладчик сохранял стабильность на протяжении всей речи, демонстрируя уверенность.",
              "ДлительностьНестабильности": "Докладчик не показывал моментов нестабильности.",
              "Комментарий": "В целом, докладчик демонстрировал отличный баланс и стабильность."
            }
          },
          "Анализ Жестов": {
            "ЖестыРук": {
              "ОткрытаяЛадонь": "Докладчик часто использовал жесты с открытой ладонью, что передавало открытость и искренность.",
              "УказаниеПальцем": "Докладчик редко указывал пальцем, сохраняя дружелюбное поведение."
            },
            "ДвиженияРук": {
              "Диапазон": "Движения рук были динамичными и разнообразными, эффективно привлекая внимание аудитории.",
              "Плавность": "Движения рук докладчика были плавными и естественными, улучшая подачу речи."
            },
            "Движения Головы": {
              "Кивания": "Докладчик часто кивал, подчеркивая ключевые моменты и взаимодействие с аудиторией.",
              "Покачивания": "Докладчик иногда покачивал головой, чтобы подчеркнуть важные моменты."
            }
          },
          "Выражения Лица": {
            "ОбнаруженныеЭмоции": {
              "Счастье": "Докладчик часто улыбался, создавая позитивную и увлекательную атмосферу.",
              "Грусть": "Докладчик не проявлял грусти.",
              "Гнев": "Докладчик не проявлял гнева, сохраняя позитивный тон на протяжении всей речи."
            },
            "ИзмененияВыражений": "Мимика докладчика была динамичной и разнообразной, эффективно передавая широкий спектр эмоций.",
            "ЗрительныйКонтакт": {
              "Длительность": "Докладчик поддерживал зрительный контакт большую часть времени, способствуя сильной связи с аудиторией.",
              "Частота": "Докладчик часто смотрел прямо в камеру, обеспечивая непрерывное вовлечение."
            }
          },
          "Ориентация Тела": {
            "НаправлениеВзгляда": {
              "Вперед": "Докладчик в основном смотрел вперед, поддерживая прямое взаимодействие с аудиторией.",
              "Вбок": "Докладчик иногда смотрел в сторону, включая разные части аудитории."
            },
            "ИзмененияОриентации": "Докладчик плавно менял ориентацию, удерживая внимание аудитории."
          },
          "Использование Пространства": {
            "ИспользованиеЛичногоПространства": {
              "Приближение": "Докладчик иногда приближался к аудитории, усиливая чувство связи.",
              "Удаление": "Докладчик поддерживал постоянное расстояние, обеспечивая эффективное вовлечение."
            },
            "ЭффективностьИспользованияПространства": "Докладчик отлично использовал доступное пространство, что способствовало динамичной и увлекательной презентации."
          },
          "Анализ Позы": {
            "УверенностьВПозах": {
              "СредняяУверенность": "Докладчик демонстрировал высокую уверенность в своих позах на протяжении всей речи."
            },
            "Симметрия": "Поза и движения тела докладчика были высоко симметричными, что способствовало визуально приятной презентации.",
            "ПереходыПоз": "Переходы между позами были плавными и естественными, улучшая общую подачу."
          },
          "Невербальные Сигналы": {
            "Микровыражения": {
              "Нервозность": "Докладчик иногда проявлял микроэмоции волнения и страсти.",
              "ДругиеЭмоции": "Докладчик тонко передавал различные эмоции через микроэмоции, добавляя глубину речи."
            },
            "МелкиеДвижения": {
              "Подергивания": "Докладчик редко проявлял подергивания, указывая на хороший контроль над мелкими движениями.",
              "Непоседливость": "Докладчик иногда проявлял беспокойство, что указывало на скрытую страсть, а не нервозность."
            }
          }
        }
      }
    },
    "gptResponse": {

      "links":{
        "link": "https://youtu.be/tShavGuo0_E?si=UyNNZ2RkdG5zKGhz"
      },
      "Анализ настроений": {
        "score":8,
        "общий настрой": "позитивный",
        "комментарии": "Воодушевляюще и мотивирующе."
      },
      "Ясность и связность": {
        "score": 9,
        "ясность": "хорошая",
        "связность": "хорошая",
        "комментарии": "Четкое, пошаговое руководство, но требует более плавных переходов."
      },
      "Анализ тона": {
        "score": 8,
        "тон": "информационный, инструктивный",
        "комментарии": "Соответствует цели предоставления практических советов."
      },
      "Язык и грамматика": {
        "score": 9,
        "найденные ошибки": [
          "Неправильная пунктуация в 'Что если кто-то начал бы свою презентацию с? Я отправлю Google в отставку.'",
          "Слитные предложения.",
          "Отсутствие запятых в сложных предложениях."
        ],
        "предложения": [
          "Правильная пунктуация: 'Что если кто-то начал бы свою презентацию с: Я отправлю Google в отставку?'",
          "Разделите слитные предложения.",
          "Добавьте запятые для лучшего восприятия."
        ],
        "профессионализм языка": "умеренный",
        "читабельность": "хорошая"
      },
      "Вовлеченность": {
        "score": 9,
        "вовлеченность": "умеренная",
        "комментарии": "Информационно, но можно добавить больше анекдотов или примеров."
      },
      "Улучшенный текст": {
        "текст": "Ваше дело займет значительную часть вашей жизни, и единственный способ быть по-настоящему довольным — это делать то, что вы считаете великим делом. И единственный способ делать великую работу — это любить то, что вы делаете. Если вы еще не нашли это, продолжайте искать. Не останавливайтесь. Как и во всех делах сердца, вы узнаете, когда найдете это. Продолжайте искать, не останавливайтесь. Оставайтесь голодными, оставайтесь безрассудными. Спасибо."
      }
    }
  }
  